IRP/src/InformationRegisters/SystemAttributes/SystemAttributes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>SystemAttributes</name>
 <resources>
  <name>Value</name>
  <type>
   <types>Characteristic.SystemAttributes</types>
  </type>
 </resources>
 <dimensions>
  <name>Object</name>
  <type>
   <types>DocumentRef</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Property</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.SystemAttributes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Key</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>1</precision>
   </numberQualifiers>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/SystemAttributes/RecordSetModule.bsl
Procedure BeforeWrite(Cancel, Replacing)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Not ValueIsFilled(ThisObject.Filter.Object.Value) Or ThisObject.Filter.Object.Value.GetObject() = Undefined Then
		Return;
	EndIf;
	
	If Not (ThisObject.AdditionalProperties.Property("SystemRecord")
		And ThisObject.AdditionalProperties.SystemRecord = True) Then
		CommonFunctionsClientServer.ShowUsersMessage(R().Error_180);
		Cancel = True;
	EndIf;
EndProcedure
